Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གྱ་ནོམ་སྣང་བའི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་ལམ་ཤེས་པར་བྱའོ། །རྒྱུ་ཤེས་པར་བྱའོ། །འབྲས་བུ་ཤེས་པར་བྱའོ། །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་།
en: They should know the path, they should know the causal basis [of the path], and they should know the result [of the path] that leads to the gods of Ābhāsvara, the gods of Śubhakṛtsna, the gods of Bṛhatphala, the beings of the realm of nonperception, the gods of Avṛha, the gods of Atapa, the gods of Sudṛśa, the gods of Sudarśana, and the gods of Akaniṣṭha.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ལམ་ཤེས་པར་བྱའོ། །རྒྱུ་ཤེས་པར་བྱའོ། །འབྲས་བུ་ཤེས་པར་བྱའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཤེས་པར་བྱའོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: They should know the path, they should know the causal basis [of the path], and they should know the result [of the path] that leads to the gods of the sphere of infinite space, the gods of the sphere of infinite consciousness, the gods of the sphere of nothing-at-all, and the gods of the sphere of neither perception nor nonperception. “

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཤེས་པར་བྱའོ།
en: They should know the four applications of mindfulness, and they should know the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: །འཕགས་པའི་བདེན་པ་བཞི་ཤེས་པར་བྱའོ། །རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཤེས་པར་བྱའོ།
en: They should know the four truths of the noble ones, and they should know the three gateways of liberation, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, and the nine serial steps of meditative absorption.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: They should know the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion. “

source: སྙིང་རྗེ་ཆེན་པོ་ཤེས་པར་བྱའོ། །ལམ་དེ་དག་གིས་ཀྱང་སེམས་ཅན་གང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་བྱ་བ་དེ་དག་ནི།
en: They should establish in the fruit of entering the stream to nirvāṇa those who are to be established in the fruit of entering the stream to nirvāṇa.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་འགོད། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ་དགོད་པར་བྱ་བ་དེ་དག་ནི། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ་འགོད།
en: They should establish in the fruit of being destined for only one more rebirth those who are to be established in the fruit of being destined for only one more rebirth.

source: གང་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་དགོད་པར་བྱ་བ་དེ་དག་ནི། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་འགོད།
en: They should establish in the fruit of no longer being subject to rebirth those who are to be established in the fruit of no longer being subject to rebirth.

source: གང་དགྲ་བཅོམ་པ་ཉིད་ལ་དགོད་པར་བྱ་བ་དེ་དག་ནི། དགྲ་བཅོམ་པ་ཉིད་ལ་འགོད།
en: They should establish in arhatship those who are to be established in arhatship.

source: གང་རང་བྱང་ཆུབ་ལ་དགོད་པར་བྱ་བ་དེ་དག་ནི། རང་བྱང་ཆུབ་ལ་འགོད།
en: They should establish in individual enlightenment those who are to be established in individual enlightenment.

source: གང་བྱང་ཆུབ་ལ་དགོད་པར་བྱ་བ་དེ་དག་ནི་བྱང་ཆུབ་ལ་འགོད་དོ།
en: They should establish in enlightenment those who are to be established in enlightenment. {

source: །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དོ།
en: Ki.V: 157} This, Subhūti, is knowledge of the path that bodhisattva great beings have. “

source: །དེ་དག་ལ་བསླབས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ལ་འཇུག་གོ །སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ལ་ཞུགས་ནས། དེ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། །དེས་ཆོས་བསྟན་པ་དེ་ཡང་འབྲས་བུ་མེད་པར་མི་འགྱུར་རོ།
en: Having trained in these attributes, bodhisattva great beings enter into the mindsets of beings, and having entered into the mindsets of beings, they accordingly teach the Dharma in such a way that it does not become fruitless.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་གཞན་གྱི་དབང་པོ་ཤིན་དུ་ཤེས་པར་བྱས་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because they have fully understood the faculties of others.

source: དེ་ནི་སེམས་ཅན་རྣམས་ཀྱི་ལམ་དང་། ལམ་མ་ཡིན་པ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་འང་རབ་ཏུ་ཤེས་སོ།
en: They know the paths and nonpaths of beings, their deaths, and also their rebirths.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱད་པར་བྱ་སྟེ།
en: Subhūti, bodhisattva great beings should practice the perfection of wisdom in that manner.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིར་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་གང་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་བྱ་བ་འམ། ཉན་ཐོས་ཀྱིས་བསླབ་པར་བྱ་བ་འམ། རང་སངས་རྒྱས་ཀྱིས་བསླབ་པར་བྱ་བའི་ཆོས་ཐམས་ཅད་གང་ཡང་མ་འདུས་པ་མེད་དོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་གང་ལགས་པ་དང་།
en: In this perfection of wisdom there is nothing at all that is not subsumed, including the factors conducive to enlightenment in which bodhisattva great beings should train, those in which śrāvakas should train, and those in which pratyekabuddhas should train.” “

source: བྱང་ཆུབ་གང་ལགས་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ལྡན་པ་ཡང་མ་ལགས་མི་ལྡན་པ་ཡང་མ་ལགས། གཟུགས་མ་མཆིས་པ་བསྟན་དུ་མ་མཆིས་པ། ཐོགས་པ་མ་མཆིས་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མ་མཆིས་པར་མཚན་ཉིད་གཅིག་ན། ཇི་ལྟར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བྱང་ཆུབ་སྒྲུབ་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ལྡན་པ་ཡང་མ་ལགས། མི་ལྡན་པ་ཡང་མ་ལགས་ལ། གཟུགས་མ་མཆིས་ཤིང་། བསྟན་དུ་མ་མཆིས། ཐོགས་པ་མ་མཆིས། འདི་ལྟར་མཚན་ཉིད་མ་མཆིས་པར།
en: Blessed Lord, if the factors that are conducive to enlightenment and all those attributes that constitute enlightenment are neither conjoined nor disjoined, immaterial, invisible, unimpeded, and their sole defining characteristic is that they are without defining characteristics, how do bodhisattva great beings nurture enlightenment?

source: མཚན་ཉིད་གཅིག་པ་ནི་ཆོས་གང་ལ་ཡང་སྒྲུབ་པ་འམ། འཇིག་པར་བགྱིད་པ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའ་ནི་ཆོས་གང་ལ་ཡང་སྒྲུབ་པ་འམ་འཇིག་པར་མི་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ནི།
en: Blessed Lord, phenomena that are neither conjoined nor disjoined, immaterial, invisible, unimpeded, and with the sole defining characteristic that they are without defining characteristics cannot bring about or destroy anything at all, Blessed Lord, just as space does not bring about or destroy anything at all; in the same way, Blessed Lord, phenomena that are empty of their own defining characteristics cannot nurture or starve anything at all.” “

source: ཆོས་གང་ལ་ཡང་སྒྲུབ་པ་འམ། འཇིག་པར་བགྱིད་པ་མ་མཆིས་སོ།
en: Subhūti, it is so!

source: རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ནི་ཆོས་གང་ལ་ཡང་སྒྲུབ་པ་འམ་འཇིག་པར་བྱེད་པ་མེད་དོ།
en: Phenomena that are empty of their own defining characteristics do not bring about or destroy anything at all.

source: །རབ་འབྱོར་སེམས་ཅན་གང་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་མི་ཤེས་པ་དེ་དག་གི་དོན་དུ་འདི་སྐད་དུ། འདི་དག་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་བྱང་ཆུབ་ཐོབ་པར་བྱེད་པའོ་ཞེས་བཤད་ཀྱི། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་གང་ཡིན་པ་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་གང་ཡིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ནང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། ཕྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གཏན་དང་པོ་གང་ཡིན་པ་དང་།
en: Subhūti, for the sake of those beings who do not know that phenomena are empty of their own defining characteristics, it is explained that these factors conducive to enlightenment do lead to the attaining of enlightenment.

source: བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་གང་ཡིན་པ་དང་། བྱམས་པ་གང་ཡིན་པ་དང་། སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ཀྱི་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་གང་ཡིན་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་གང་ཡིན་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་གང་ཡིན་པ་དང་།
en: However, Subhūti, all these phenomena [mentioned in] the Dharma and the Vinaya, comprising physical forms; comprising feelings, perceptions, formative predispositions, and consciousness; comprising the sense fields, the sensory elements, and the links of dependent origination; comprising the perfection of generosity; comprising the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; comprising the emptiness of internal phenomena; comprising the emptiness of external phenomena; comprising the emptiness of external and internal phenomena, which comprise [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; comprising the first meditative concentration; comprising the second meditative concentration, the third meditative concentration, and the fourth meditative concentration; comprising loving kindness; comprising absorptions in compassion, empathetic joy, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ཆོས་དང་འདུལ་བ་འདི་ལ་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ་བསྟན་དུ་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ།
en: V: 158} and equanimity; comprising absorption in the sphere of infinite space; comprising absorption in the sphere of infinite consciousness, absorption in the sphere of nothing-at-all, and absorption in the sphere of neither perception nor nonperception; comprising the applications of mindfulness; comprising the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; comprising the truths of the noble ones, the three gateways of liberation, the eight aspects of liberation, the nine serial steps of meditative absorption, the meditative stabilities, and the dhāraṇī gateways; comprising the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion; and comprising [the goals], up to and including all-aspect omniscience, are neither conjoined nor disjoined, immaterial, invisible, unimpeded, and their sole defining characteristic is that they are without defining characteristics.

source: འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་ཀྱང་། དེ་དག་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་གཟུང་བར་བྱ་བའི་དོན་དུ་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱིས་དེ་སྐད་དུ་བརྗོད་དེ། དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: These are just expressed in mundane conventional terms in order that beings might grasp them, but that is not the case in ultimate [truth]. “

source: །དེ་དག་ཐམས་ཅད་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་པ་དང་། མཐོང་བས་བསླབ་པར་བྱ་སྟེ།
en: Bodhisattva great beings should train in all these through their cognition and insight.

source: ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་དང་། མཐོང་བས་བསླབས་ནས། ཆོས་ལ་ལ་ནི་མངོན་དུ་བྱའོ། །ལ་ལ་ནི་མངོན་དུ་མི་བྱའོ།
en: Having trained through definitive cognition and insight, there are some attributes that they should actualize, and some that they should not actualize.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་གང་ནི་ཤེས་པ་དང་མཐོང་བས་བསླབས་ཏེ་མངོན་དུ་བྱའི། ཆོས་གང་ནི་མངོན་དུ་མི་བྱ་ཞེ་ན། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཤེས་པ་དང་མཐོང་བས་བསླབས་ཏེ། མངོན་དུ་མི་བྱའོ།
en: In this regard, if you ask which attributes bodhisattva great beings should actualize, having trained in them, and which attributes they should not actualize, they should not actualize the attributes of the śrāvakas and pratyekabuddhas, having trained in them through cognition and insight.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་དུ་བྱ་སྟེ།
en: On the other hand, they should actualize all attributes in all respects through the wisdom of all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཕགས་པའི་ཆོས་དང་། འདུལ་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །གསོལ་པ།
en: Subhūti, it is in this way that bodhisattva great beings should train in the perfection of wisdom that constitutes the Dharma and Vinaya of the noble ones.” “

source: བཅོམ་ལྡན་འདས་འཕགས་པའི་ཆོས་དང་། འདུལ་བ་འཕགས་པའི་ཆོས་དང་།
en: The Blessed One speaks of the ‘Dharma and Vinaya of the noble ones.’

source: འདུལ་བ་ཞེས་བགྱི་བ་དེ་ཇི་ཙམ་གྱིས་ན། འཕགས་པའི་ཆོས་དང་འདུལ་བ་ཞེས་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: What is the extent of the Dharma and Vinaya of the noble ones?” “

source: རབ་འབྱོར་འདི་ལ་ཉན་ཐོས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི། འདོད་ཆགས་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: In this regard, Subhūti,” replied the Blessed One, “śrāvakas, pratyekabuddhas, bodhisattva great beings, and the tathāgatas, arhats, completely awakened buddhas neither have desire, nor are they without it.

source: ཞེ་སྡང་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have hatred, nor are they without it.

source: གཏི་མུག་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have delusion, nor are they without it.

source: འཇིག་ཚོགས་སུ་ལྟ་བ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have false views about perishable composites, nor are they without them.

source: ཐེ་ཙོམ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have hesitation, nor are they without it.

source: ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་སྙོམས་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have moral and ascetic supremacy, nor are they without them.

source: འདོད་པའི་འདོད་ཆགས་དང་གནོད་སེམས་དང་། ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have attachment or malice for the realm of desire, nor are they without them.

source: གཟུགས་དང་གཟུགས་མེད་པའི་འདོད་ཆགས་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have attachment for the realms of form and formlessness, nor are they without it.

source: མ་རིག་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have ignorance, nor are they without it.

source: ང་རྒྱལ་དང་རྒོད་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have pride {Ki.V: 159} or mental agitation, nor are they without them.

source: བསམ་གཏན་དང་པོ་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have the first meditative concentration, nor are they without it.

source: བསམ་གཏན་གཉིས་པ་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have the second meditative concentration, nor are they without it.

source: བསམ་གཏན་གསུམ་པ་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have the third meditative concentration, nor are they without it.

source: བསམ་གཏན་བཞི་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have the fourth meditative concentration, nor are they without it.

source: བྱམས་པ་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have loving kindness, nor are they without it.

source: སྙིང་རྗེ་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have compassion, nor are they without it.

source: དགའ་བ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have empathetic joy, nor are they without it.

source: བཏང་སྙོམས་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have equanimity, nor are they without it.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have absorption in the sphere of infinite space, nor are they without it.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They neither have absorption in the sphere of infinite consciousness, absorption in the sphere of nothing-at-all, and absorption in the sphere of neither perception nor nonperception, nor are they without them.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They neither have the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, nor are they without them.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: They neither have the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, nor are they without them.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན།
en: They neither have the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion, nor are they without them.

source: འདུས་བྱས་ཀྱི་ཁམས་དང་འདུས་མ་བྱས་ཀྱི་ཁམས་དང་། ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་པས།
en: They neither have the conditioned elements and the unconditioned elements, nor are they without them.

source: དེའི་ཕྱིར་དེ་དག་ནི་འཕགས་པ་ཞེས་བྱ་སྟེ།
en: It is for this reason that they are called the noble ones.

source: འདི་ནི་དེ་དག་གི་ཆོས་དང་འདུལ་བ་ཡིན་པས། དེའི་ཕྱིར་འཕགས་པའི་ཆོས་འདུལ་བ་ཞེས་བྱའོ།
en: The expression Dharma and Vinaya of the noble ones denotes their Dharma and Vinaya. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་དེ་དག་ཐམས་ཅད་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་སྟེ།
en: If you ask why, it is because all these phenomena are immaterial, invisible, unimpeded, and they have the sole defining characteristic that they are without defining characteristics.

source: དེ་དག་ནི་གཟུགས་མེད་པ་དང་གཟུགས་མེད་པར་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: This means that they are immaterial, neither conjoined with the immaterial nor disjoined from it.

source: །བསྟན་དུ་མེད་པ་དང་། བསྟན་དུ་མེད་པར་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: They are invisible, neither conjoined with the invisible nor disjoined from it.

source: །ཐོགས་པ་མེད་པ་དང་། ཐོགས་པ་མེད་པར་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: They are unimpeded, neither conjoined with the unimpeded nor disjoined from it.

source: །མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་མེད་པར་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: They are without defining characteristics, neither conjoined with the absence of defining characteristics nor disjoined from it.

source: །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ། མཚན་ཉིད་གཅིག་པ། མཚན་ཉིད་མེད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: This, Subhūti, is the transcendence of the immaterial, of the invisible, of the unimpeded, and of the sole defining characteristic that phenomena are without defining characteristics, which bodhisattva great beings have.

source: །དེས་དེ་ལ་བསླབས་ན། ཆོས་ཀྱི་མཚན་ཉིད་གང་ཡང་དམིགས་པར་མི་འགྱུར་རོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: When they have trained in it, they do not apprehend the defining characteristic of anything at all.”

source: བཅོམ་ལྡན་འདས་འོ་ན་གཟུགས་ཀྱི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། ནང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། བསམ་གཏན་དང་པོའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ། བྱམས་པ་ཆེན་པོའི་མཚན་ཉིད་ལ་བསླབ་པར་མི་བགྱི་འམ།
en: Subhūti then asked, “In that case, Blessed Lord, if they do not train in the defining characteristics of physical forms; if they do not train in the defining characteristics of feelings, perceptions, formative predispositions, and consciousness; if they do not train in the defining characteristics of the sense fields, the sensory elements, and the links of dependent origination; {Ki.
